

test(1,1);
test([1,2,3],[1,2,3]);
test({"a":1,"b":2},{"b":2,"a":1})

// 'use strict'
// // 1行目に記載している 'use strict' は削除しないでください

// function test(actual, expected) {
//     if (JSON.stringify(actual) === JSON.stringify(expected)) {
//         console.log("Yay! Test PASSED.");
//     } else {
//         console.error("Test FAILED. Keep trying!");
//         console.log("    actual: ", actual);
//         console.log("  expected: ", expected);
//         console.trace();
//     }
// }

///////////////////////////////
///ウォームアップ
///////////////////////////////
// //ウォームアップ１

// //ペア演習
// //ペア演習1
// console.log("ペア演習１")

// //ペア演習2
// console.log("ペア演習2")

// //ペア演習3
// console.log("ペア演習3")

// //ペア演習4
// console.log("ペア演習4")

// //基礎演習1
// console.log("基礎演習1")

// //基礎演習2
// console.log("基礎演習2")

// //基礎演習3
// console.log("基礎演習3")

// //中級演習1
// console.log("中級演習1")

// //中級演習2
// console.log("中級演習2")

// //中級演習3
// console.log("中級演習3")

// //中級演習4
// console.log("中級演習4")

// //中級演習5
// console.log("中級演習5")

// //中級演習6'
// console.log("中級演習6")

// //応用演習1
// console.log("応用演習1")

// //応用演習2
// console.log("応用演習2")

// //応用演習3
// console.log("応用演習3")

// //ナイトメア問題 😈
// console.log("ナイトメア問題 😈")
